Revit 2027 API
RebarConstraint.GetTargetCoverTypeForToHostEdgeConstraint Method
 Returns the RebarCoverType for the face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'. Returns null if no RebarHostData is present for target element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarCoverType GetTargetCoverTypeForToHostEdgeConstraint(
	int targetIndex,
	int faceIndex
)
Public Function GetTargetCoverTypeForToHostEdgeConstraint (
	targetIndex As Integer,
	faceIndex As Integer
) As RebarCoverType
public:
RebarCoverType^ GetTargetCoverTypeForToHostEdgeConstraint(
	int targetIndex,
	int faceIndex
)
member GetTargetCoverTypeForToHostEdgeConstraint :
        targetIndex : int *
        faceIndex : int -> RebarCoverType
Parameters
targetIndex Int32
 The index of the target. Should be between 0 and NumberOfTargets().
faceIndex Int32
 The face index of the edge. Should be 0 or 1.
Return Value
RebarCoverType
 Returns the RebarCoverType for the face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex.
Exceptions
Exception | Condition
ArgumentException |  targetIndex is out of range. -or- faceIndex must be 0 or 1.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdge' or 'ToHostEdgeCover'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace